In [6]:
!pip install pandas
import pandas as pd
import numpy as np
b=pd.Series([1,2,3])
b

Requirement already satisfied: pandas in c:\users\dell\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\dell\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\dell\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

0    1
1    2
2    3
dtype: int64

In [8]:
a=pd.Series([1,2,3,4],index=['a','b','c','d'])
a

a    1
b    2
c    3
d    4
dtype: int64

In [11]:
a=pd.Series([1,2,3,4],index=['a','b','c','d'],dtype='float')
a

a    1.0
b    2.0
c    3.0
d    4.0
dtype: float64

In [13]:
c=pd.Series({'a':1,'b':2,'c':3})
c

a    1
b    2
c    3
dtype: int64

In [79]:
d=pd.DataFrame([[1,2,3,4],[3,4,5,6]],columns=['a','b','c','d'],index=['x','y'])
d

   a  b  c  d
x  1  2  3  4
y  3  4  5  6

In [56]:
h=[{'abhi':1,'ram':2},{'naresh':2,'syam':5},{'naresh':6,'abhi':7,'ram':8}]
g=pd.DataFrame(h,index=['a','b','c'])
g

   abhi  ram  naresh  syam
a   1.0  2.0     NaN   NaN
b   NaN  NaN     2.0   5.0
c   7.0  8.0     6.0   NaN

In [57]:
print(d)
d['e']=d['a']*d['b']
d['f']=d['a']+d['b']

   a  b  c  d
x  1  2  3  4
y  3  4  5  6

In [71]:
d.insert(2,'hai',d['c'])
d

ValueError: cannot insert hai, already exists

In [83]:
k={'a':4,'b':3,'c':5,'d':3}
l=d.append(k,ignore_index=True)
l

AttributeError: 'DataFrame' object has no attribute 'append'

In [98]:
import numpy as np
n=pd.DataFrame({'a':np.random.randint(2,6,size=(10)),'b':np.random.randint(4,8,size=(10)),'c':np.random.randint(1,6,size=(10))})
n

   a  b  c
0  3  6  3
1  2  6  1
2  5  6  1
3  3  5  5
4  2  6  5
5  4  7  5
6  4  4  3
7  4  5  1
8  4  6  5
9  3  5  2

In [103]:
n.head(3)

   a  b  c
0  3  6  3
1  2  6  1
2  5  6  1

In [104]:
n.tail(4)

   a  b  c
6  4  4  3
7  4  5  1
8  4  6  5
9  3  5  2

In [105]:
n.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       10 non-null     int32
 1   b       10 non-null     int32
 2   c       10 non-null     int32
dtypes: int32(3)
memory usage: 252.0 bytes

In [107]:
n.describe()

               a          b          c
count  10.000000  10.000000  10.000000
mean    3.400000   5.600000   3.100000
std     0.966092   0.843274   1.791957
min     2.000000   4.000000   1.000000
25%     3.000000   5.000000   1.250000
50%     3.500000   6.000000   3.000000
75%     4.000000   6.000000   5.000000
max     5.000000   7.000000   5.000000

In [109]:
n.loc[9,'a']

3

In [113]:
n.loc[4:9],['a','b']

(   a  b  c
 4  2  6  5
 5  4  7  5
 6  4  4  3
 7  4  5  1
 8  4  6  5
 9  3  5  2,
 ['a', 'b'])

In [116]:
n.loc[[3,4,5],['a','b']]

   a  b
3  3  5
4  2  6
5  4  7

In [117]:
n.a.values

array([3, 2, 5, 3, 2, 4, 4, 4, 4, 3])

In [122]:
n['sub']=n.a.values-n.b.values-n.c.values
n

   a  b  c  sub
0  3  6  3   -6
1  2  6  1   -5
2  5  6  1   -2
3  3  5  5   -7
4  2  6  5   -9
5  4  7  5   -8
6  4  4  3   -3
7  4  5  1   -2
8  4  6  5   -7
9  3  5  2   -4

In [166]:
m=[['ram',1,1500],['syam',2,2000],['naresh',3,2500]]
hello=pd.DataFrame(m,columns=['name','rollno','salary'])
hello
#hai=hello[hello.salary>=2000]
#print(hai)
#hai[['rollno','salary']]

     name  rollno  salary
0     ram       1    1500
1    syam       2    2000
2  naresh       3    2500

In [179]:
hello.append({'name':'vijay','rollno':4,'salary':3000},ignore_index=True)
hello

AttributeError: 'DataFrame' object has no attribute 'append'

In [176]:
hello=hello.append({'name':np.nan,'rollno':4,'salary':2500},ignore_index=True)
hello

AttributeError: 'DataFrame' object has no attribute 'append'

In [180]:
hello.isnull()

    name  rollno  salary
0  False   False   False
1  False   False   False
2  False   False   False

In [182]:
hello.isnull().sum()

name      0
rollno    0
salary    0
dtype: int64

In [183]:
hello.dropna()

     name  rollno  salary
0     ram       1    1500
1    syam       2    2000
2  naresh       3    2500

In [184]:
hello.fillna(value='hai')

     name  rollno  salary
0     ram       1    1500
1    syam       2    2000
2  naresh       3    2500

In [185]:
hello.drop([0],axis=0,inplace=True)
hello

     name  rollno  salary
1    syam       2    2000
2  naresh       3    2500

In [189]:
p=pd.DataFrame({'animals':['falcon','falcon','parrot','parrot'],'speed':[380,370,24,26]})
p

  animals  speed
0  falcon    380
1  falcon    370
2  parrot     24
3  parrot     26

In [190]:
p.groupby(['animals']).mean()

         speed
animals
falcon   375.0
parrot    25.0

In [197]:
import pandas as pd
import numpy as np
df=pd.DataFrame(np.random.randn(4,3),columns=['c1','c2','c3'])
print(df)
print('\n')
for key,value in df.iteritems():
    print(key,value)
    print('\n')

         c1        c2        c3
0 -1.063306  1.092014  1.009627
1  0.272448  2.108313 -0.786492
2 -0.487756  2.388608  0.279179
3  0.212281  0.748410  0.126259

AttributeError: 'DataFrame' object has no attribute 'iteritems'

In [201]:
import pandas as pd
import numpy as np
df=pd.DataFrame(np.random.randn(4,3),columns=['c1','c2','c3'])
print(df)
print('\n')
for key,value in df.iterrows():
    print(rows)
    print('\n')

         c1        c2        c3
0  2.358318  0.478843  1.155878
1 -0.875085  0.191668  0.511318
2  0.939509 -0.799631  0.401445
3  0.947850 -1.067299 -0.009835

NameError: name 'rows' is not defined

In [202]:
df.transpose

<bound method DataFrame.transpose of          c1        c2        c3
0  2.358318  0.478843  1.155878
1 -0.875085  0.191668  0.511318
2  0.939509 -0.799631  0.401445
3  0.947850 -1.067299 -0.009835>

In [213]:
data={'firstname':['arun','jebu','venkat','rekha','majid','moshin'],'lastname':['kumar','jacob','raghavan','singh','khan','khan'],'employmenttype':['service','business','student','service','business','business'],'country':['india','usa','usa','swedan','australia','germany']}
df=pd.DataFrame(data,columns=['firstname','lastname','employmenttype','country'])
df
df1=pd.get_dummies(df['employmenttype'])
print(df1)
df2=pd.get_dummies(df['country'])
print(df2)

   business  service  student
0     False     True    False
1      True    False    False
2     False    False     True
3     False     True    False
4      True    False    False
5      True    False    False
   australia  germany  india  swedan    usa
0      False    False   True   False  False
1      False    False  False   False   True
2      False    False  False   False   True
3      False    False  False    True  False
4       True    False  False   False  False
5      False     True  False   False  False

In [215]:
frames=[df,df1,df2]
result=pd.concat(frames,axis=1)
result

,firstname,lastname,employmenttype,country,business,service,student,australia,germany,india,swedan,usa
0,arun,kumar,service,india,False,True,False,False,False,True,False,False
1,jebu,jacob,business,usa,True,False,False,False,False,False,False,True
2,venkat,raghavan,student,usa,False,False,True,False,False,False,False,True
3,rekha,singh,service,swedan,False,True,False,False,False,False,True,False
4,majid,khan,business,australia,True,False,False,True,False,False,False,False
5,moshin,khan,business,germany,True,False,False,False,True,False,False,False

In [228]:
import pandas as pd
indian_weather=pd.DataFrame({'city':['mumbai','delhi','bangalore'],'temp':[43,56,34]})
indian_weather

        city  temp
0     mumbai    43
1      delhi    56
2  bangalore    34

In [229]:
import pandas as pd
us_weather=pd.DataFrame({'city':['newyork','chicago','canada'],'temp':[33,65,54]})
us_weather

      city  temp
0  newyork    33
1  chicago    65
2   canada    54

In [232]:
results=pd.concat([indian_weather,us_weather],ignore_index=True)
results

        city  temp
0     mumbai    43
1      delhi    56
2  bangalore    34
3    newyork    33
4    chicago    65
5     canada    54

In [233]:
results=pd.concat([indian_weather,us_weather],keys=['india','us'])
results

              city  temp
india 0     mumbai    43
      1      delhi    56
      2  bangalore    34
us    0    newyork    33
      1    chicago    65
      2     canada    54

In [237]:
import pandas as pd
emp=pd.DataFrame('name':['parker','smith','william','parker'],'age':[21,22,34,21])
#info=pd.DataFrame(emp)

SyntaxError: expression cannot contain assignment, perhaps you meant "=="? (3751212917.py, line 2)

In [241]:
import pandas as pd
def calc_sum(naresh):
    return naresh+1
data={
    'x'=[23,54],
    'y'=[67,56]
}
z=pd.DataFrame(data)
print(z)
x=z.apply(calc_sum)
print(x)

SyntaxError: cannot assign to literal here. Maybe you meant '==' instead of '='? (2019421471.py, line 5)